src_doc/InformationRegisters/МоиДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МоиДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВМоиДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПричины</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/Enums/ПричиныДобавленияВМоиДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВМоиДокументы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДобавленВручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначенаЗадачаМне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаЗадачаОтМеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьАвторомДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьАвторомУтвержденияДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьОтветственнымЗаДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯвляюсьПодписантомДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_doc/CommonModules/МоиДокументы/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Мои документы (сервер)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр "Мои документы"
//
// Параметры:
//   Документ 	  - СправочникСсылка.ДокументыПредприятия - добавляемый документ 
//   Причина 	  - ПеречислениеСсылка.ПричиныДобавленияВМоиДокументы - 
//   				причина добавления в Мои документ
//   Сотрудник - СправочникСсылка.Сотрудники - Сотрудник, для которого добавляется документ,
//		   			если не указан, то текущий.
//   ИсточникПричины - ДокументСсылка.ДействиеЗадачи, ДокументСсылка.Задача - к какой задаче относится причина
//   ОтразитьНемедленно - Булево
//
Процедура ДобавитьЗаписьВМоиДокументы(Документ, Причина, Сотрудник = Неопределено,
	ИсточникПричины = Неопределено, ОтразитьНемедленно = Ложь) Экспорт 
	
	Если Сотрудник = Неопределено Тогда 
		Сотрудник = Сотрудники.ОсновнойСотрудник();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") 
		И ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Пользователи") Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.МоиДокументы.ДобавитьВМоиДокументы(
		Сотрудник,
		Документ,
		Причина,
		ИсточникПричины,
		ОтразитьНемедленно);
	
КонецПроцедуры	

// Добавляет записи в регистр "Мои документы"
//
// Параметры:
//   Документы 	  - Массив из СправочникСсылка.ДокументыПредприятия - массив добавляемых документов
//   Причина 	  - ПеречислениеСсылка.ПричиныДобавленияВМоиДокументы - 
//   				причина добавления в Мои документы
//   Сотрудник - СправочникСсылка.Сотрудники - Сотрудник, для которого добавляется документ,
//   				если не указан, то текущий.
//
Процедура ДобавитьЗаписиВМоиДокументы(Документы, Причина, Сотрудник = Неопределено) Экспорт 

	Для Каждого Документ Из Документы цикл
		ДобавитьЗаписьВМоиДокументы(Документ, Причина, Сотрудник);
	КонецЦикла;	
	
КонецПроцедуры

// Удаляет запись из регистра "Мои документы"
//
// Параметры:
//   Документ 	  - СправочникСсылка.ДокументыПредприятия - удаляемый документ
//   Причина 	  - ПеречислениеСсылка.ПричиныДобавленияВМоиДокументы - 
//   				причина добавления в Мои документы 
//   Сотрудник - СправочникСсылка.Сотрудники - Сотрудник, для которого удаляется документ,
//   				если не указан, то текущий. 
//   ИсточникПричины - ДокументСсылка.ДействиеЗадачи, ДокументСсылка.Задача - к какой задаче относится причина
//
Процедура УдалитьЗаписьИзМоиДокументы(Документ, Причина, Знач Сотрудник = Неопределено,
	ИсточникПричины=Неопределено) Экспорт 
	
	Если Сотрудник = Неопределено Тогда 
		Сотрудник = Сотрудники.ОсновнойСотрудник();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") 
		И ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Пользователи") Тогда
		Возврат;
	КонецЕсли;
	
	Если Причина = Перечисления.ПричиныДобавленияВМоиДокументы.НазначенаЗадачаМне 
		Или Причина = Перечисления.ПричиныДобавленияВМоиДокументы.ОтправленаЗадачаОтМеня Тогда
		
			НаборЗаписей = РегистрыСведений.МоиДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Документ);
			НаборЗаписей.Отбор.Причина.Установить(Причина);
			НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
			НаборЗаписей.Прочитать();
			
			КоличествоЗаписей = НаборЗаписей.Количество();
			Если КоличествоЗаписей = 0 Тогда
				Возврат;
			Иначе
				
				ЗаполнялсяИсточникПриСоздании = ЗначениеЗаполнено(НаборЗаписей[0].ИсточникПричины);
				
				Если ЗаполнялсяИсточникПриСоздании Тогда
					
					НаборЗаписей.Отбор.ИсточникПричины.Установить(ИсточникПричины); 
					НаборЗаписей.Прочитать();
					
				КонецЕсли;
				
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать();
				
			КонецЕсли;
		
	Иначе
		
		МенеджерЗаписи = РегистрыСведений.МоиДокументы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Документ = Документ;
		МенеджерЗаписи.Причина = Причина;
		МенеджерЗаписи.Сотрудник = Сотрудник;
		МенеджерЗаписи.Прочитать();
		
		Если ЗначениеЗаполнено(МенеджерЗаписи.ИсточникПричины) Тогда
			МенеджерЗаписи.ИсточникПричины = ИсточникПричины; 
		КонецЕсли;
		
		МенеджерЗаписи.Удалить(); 
		
	КонецЕсли;
	
КонецПроцедуры

// Удаляет записи из регистра "Мои документы"
//
// Параметры:
//   Документы 	  - Массив из СправочникСсылка.ДокументыПредприятия - удаляемые документы
//   Причина 	  - ПеречислениеСсылка.ПричиныДобавленияВМоиДокументы - 
//   				причина добавления в Мои документы
//   Сотрудник - СправочникСсылка.Сотрудники - Сотрудник, для которого удаляется документ,
//   				если не указан, то текущий.
//
Процедура УдалитьЗаписиИзМоиДокументы(Документы, Причина, Сотрудник = Неопределено) Экспорт 
	
	Для Каждого Документ Из Документы Цикл
		УдалитьЗаписьИзМоиДокументы(Документ, Причина, Сотрудник);
	КонецЦикла;
	
КонецПроцедуры	

// Удаляет все записи по документу из регистра "Мои документы"
//
// Параметры:
//   Документ 		- СправочникСсылка.ДокументыПредприятия - удаляемый документ
//   Сотрудник   - СправочникСсылка.Сотрудники - Сотрудник, для которого удаляется документ,
//   				  если не указан, то текущий.
//
Процедура УдалитьДокументИзМоиДокументы(Документ, Сотрудник = Неопределено) Экспорт 

	Если Сотрудник = Неопределено Тогда 
		Сотрудник = Сотрудники.ОсновнойСотрудник();
	КонецЕсли;
		
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") 
		И ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Пользователи") Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиПользователя = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник);
	ОтразитьНемедленно = Ложь;
	РегистрыСведений.МоиДокументы.УдалитьИзМоихДокументов(Документ, СотрудникиПользователя, ОтразитьНемедленно);
	
КонецПроцедуры	

// Удаляет все записи по документу из регистра "Мои документы" для текущего пользователя.
//
// Параметры:
//   Документ - СправочникСсылка.ДокументыПредприятия
//   СотрудникиПользователя - СправочникСсылка.Сотрудники
//   ОтразитьНемедленно - Булево
//
Процедура УдалитьИзМоихДокументов(Документ, СотрудникиПользователя, ОтразитьНемедленно) Экспорт 
	
	РегистрыСведений.МоиДокументы.УдалитьИзМоихДокументов(Документ, СотрудникиПользователя, ОтразитьНемедленно);
	
КонецПроцедуры	

// Проверяет, что переданный документ входит в "Мои документы"
//
// Параметры:
//   Документ 		- СправочникСсылка.ДокументыПредприятия - проверяемый документ
//   Сотрудник   - СправочникСсылка.Сотрудники - Сотрудник, для которого проверяется документ,
//   				  если не указан, то текущий.
// 
// Возвращаемое значение:
//  Булево
//
Функция ДокументВходитВМоиДокументы(Документ, Сотрудник = Неопределено) Экспорт 
	
	Если Сотрудник = Неопределено Тогда 
		СотрудникиПользователя = Сотрудники.ВсеСотрудникиТекущегоПользователя(Ложь);
	Иначе
		СотрудникиПользователя = Новый Массив;
		СотрудникиПользователя.Добавить(Сотрудник);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.МоиДокументы КАК МоиДокументы
		|ГДЕ
		|	МоиДокументы.Сотрудник В (&Сотрудники)
		|	И МоиДокументы.Документ = &Документ";
	Запрос.Параметры.Вставить("Сотрудники", СотрудникиПользователя);
	Запрос.Параметры.Вставить("Документ", Документ);
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

// Определяет причины добавления в "Мои документы" для пользователя.
// 
// Параметры:
//  ДокументПредприятия - СправочникСсылка.ДокументыПредприятия
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ПричиныДобавленияВМоиДокументы
// 
Функция ПричиныДобавленияВМоиДокументы(ДокументПредприятия, Пользователь) Экспорт
	
	ПричиныДобавленияВМоиДокументы = Новый Массив;
	Если Не ЗначениеЗаполнено(ДокументПредприятия) Или Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат ПричиныДобавленияВМоиДокументы;
	КонецЕсли;
	
	СотрудникиПользователя = Сотрудники.СотрудникиПользователя(Пользователь, Ложь);
	Если СотрудникиПользователя.Количество() = 0 Тогда
		Возврат ПричиныДобавленияВМоиДокументы;
	КонецЕсли;
	
	ПричиныДобавленияВМоиДокументы = РегистрыСведений.МоиДокументы.ПричиныДобавленияВМоиДокументы(
		ДокументПредприятия,
		СотрудникиПользователя);
	
	Возврат ПричиныДобавленияВМоиДокументы;
	
КонецФункции

#КонецОбласти
